define(
    {
    	
    	//获得临分业务分赔类型
    	"clmassTypes" : [
    		{"id": "0", "value": "估损"},
            {'id': "5", "value": "估损"},
            {"id": "1", "value": "预赔"},
            {'id': "3", "value": "预赔"},
            {"id": "6", "value": "预赔"},
            {'id': "2", "value": "结案"},
            {'id': "4", "value": "结案"},
            {'id': "7", "value": "结案"}
    	],
    
    	
    	//获得手工处理类型
    	"handleCertiType" : [
    		{"id": "1", "value": "追偿"},
            {'id': "2", "value": "损余回收"}
    	],
    	
    	//获得手工处理赔款类型
    	"handleClmassType1" : [
    		{"id": "3", "value": "追偿预赔"},
            {'id': "4", "value": "追偿结案"}
    	],
    	
    	//获得手工处理赔款类型
    	"handleClmassType2" : [
    		{"id": "5", "value": "损余回收立案"},
    		{"id": "6", "value": "损余回收预赔"},
            {'id': "7", "value": "损余回收结案"}
    	],
    
        //比例分保基础
        "prop.rePremiumBase" : [
            {"id": "00", "value": "00-毛保费"},
            {'id': "01", "value":"01-净保费"}
        ],
        
        //比例计算基础
        "prop.calculateBase" : [
            {"id": "0", "value": "0-风险单位总保额"},
            {'id': "1", "value":"1-自留额"}
        ],

        //非比例恢复保费类型
        "nprop.reinstTypes" : [
            {"id": "0", "value": "free"},
            {'id': "1", "value":"固定比例恢复"},
            {'id': "2", "value":"时间比例恢复"}
        ],

        //比例合同状态
        "prop.stateFlag" : [
            {"id": "0", "value": "暂存"},
//            {'id': "1", "value":"申请审核"},
//            {'id': "2", "value":"返回修改"},
            {"id": "4", "value": "已生效"},
            {"id": "6", "value": "已关闭"}
        ],

        //比例合同类型
        "prop.treatyType" : [
//            {"id": "11", "value": "法定"},
            {"id": "31", "value": "成数合约"},
//            {"id": "81", "value": "自留"},
//            {"id": "91", "value": "临分"},
            {"id": "21", "value": "溢额合约"},
//            {"id": "22", "value": "第二溢额"},
            {"id": "41", "value": "opencover"},
//            {"id": "82", "value": "附加自留"}
        ],

        //比例合同业务类型     ---------------4-29 字段名、id序号
        "prop.optType" :[
            {"id": "00", "value": "分出"},
            {"id": "01" ,"value": "分入"},
           
        ],

        //非比例合同业务类型
        "nprop.inoutMrk" :[
            {"id": "1", "value": "分出"}
//            {"id": "0" ,"value": "分入"}
        ],

        //比例合同账单期
        "prop.accPeriod" :[
            {"id": "M" ,"value": "月度"},
            {"id": "Q" ,"value": "季度"},
            {"id": "H" ,"value": "半年"},
            {"id": "Y" ,"value": "全年"}
        ],
        "prop.settleTypCde":[
            {"id":"0","value":"0-Run Off"},
            {"id":"1","value":"1-Clean Cut"}
        ],
        "prop.cashLossFlag":[
            {"id":"0","value":"0-整个危险单位的估损"},
            {"id":"1","value":"1-进入合约的部分估损"}
        ],
        //应税免税标识
        "prop.vatFlag":[
            {"id":"0","value":"0-免税"},
            {"id":"1","value":"1-应税"}
        ],
        //纯益手续费方式
        "pcCleanMode":[
            {"id":"0","value":"0-固定"},
            {"id":"1","value":"1-财务年度"},
            {"id":"2","value":"2-业务年度"},
            {"id":"3","value":"3-亏损滚转法"}
        ],
        //非比例合同状态
        "nprop.stateFlag" : [
            {"id": "0", "value": "暂存"},
            {'id': "4", "value":"已生效"},
            {'id': "6", "value":"已关闭"},
        ],

        //非比例合同类型
        "nprop.treatyType" :  [
            {"id": "71","value": "险位超赔"},
            {"id": "72","value": "事故超赔"},
//            {"id": "73","value": "赔付率超赔"},
            {"id": "75","value": "险位事故混合超赔"}
        ],
        

        
        //比例账单类型（fuxy edit）
        "prop.billType" : [
            {"id": "06","value": "月度预提账单"}, /*月度预提账单*/
            {"id": "01","value": "季度账单"}, /*季度账单*/
            {"id": "03","value": "浮动手续费账单"}, /*浮动手续费账单*/
            {"id": "04","value": "纯益手续费账单"}, /*纯益手续费账单*/
            {"id": "02","value": "现金赔款账单"}, /*现金赔款账单*/
            /*{"id": "03","value": "手续费调整账单"} 手续费调整账单*/
        ],
        
        //add by wl  begin 20180307
        "prop.accKind" : [
            {"id": "I","value": "月度预提账单"}, /*月度预提账单*/
            {"id": "G","value": "季度账单"}, /*季度账单*/
            {"id": "A","value": "浮动手续费账单"}, /*浮动手续费账单*/
            {"id": "F","value": "纯益手续费账单"}, /*纯益手续费账单*/
            {"id": "M","value": "现金赔款账单"}, /*现金赔款账单*/
        ],
        //add by wl  end 20180307
        
        //比例账单类型Batch（fuxy edit）
        "prop.billTypeBatch" : [
            {"id": "06","value": "月度预提账单"}, /*月度预提账单*/
            {"id": "01","value": "季度账单"} /*季度账单*/
        ],

        //比例浮动手续费账单对内对外
        "prop.07.optType" : [
            {"id": "in", "value": "对内账单"},
            {"id": "out", "value": "对外账单"}
        ],

        //非比例账单类型
        ".billType" : [
            {"id": "08","value": "预付费账单"}, /*预付费账单*/
            {"id": "09","value": "超赔调整账单"}, /*超赔调整账单*/
            {"id": "10","value": "赔付率账单"}  /*赔付率账单*/
        ],

        //非比例预付费账单对内对外
        "nprop.08.optType" : [
            {"id": "in", "value": "对内账单"},
            {"id": "out", "value": "对外账单"}  /*fxy 0408 dele*/
        ],


        //比例非比例月度账单期
        "2014-01Q.accperiod" : [
            "2014-01M",
            "2014-02M",
            "2014-03M"
        ],

        //比例非比例月度账单期
        "2014-02Q.accperiod" : [
            "2014-04M",
            "2014-05M",
            "2014-06M"
        ],

        //比例非比例月度账单期
        "2014-03Q.accperiod" : [
            "2014-07M",
            "2014-08M",
            "2014-09M"
        ],

        //比例非比例月度账单期
        "2014-04Q.accperiod" : [
            "2014-10M",
            "2014-11M",
            "2014-12M"
        ],


        //投保单、批单splitType类型显示
        "splitType" : [
            {"id": "0","value": "按主险拆分"},
            {"id": "1","value": "按标的信息拆分"},
            {"id": "2","value": "按占比拆分"},
            {"id": "3","value": "按地址拆分"},
            {"id": "4","value": "按保单拆分"},
            {"id": "5","value": "按船名加航次拆分"},
            {"id": "6","value": "按原保单拆分"},
            {"id": "B","value": "按标的信息拆分"}
        ],

        //有效标志位
        "validStatus" : [
            {"id": "0","value": "无效"},
            {"id": "1","value": "有效"}
        ],

        //再保人属性
        "reinsType" : [
            {"id": "0","value": "直保公司"},
            {"id": "1","value": "经纪人"},
            {"id": "2","value": "专业再保"}
        ],
       //类型
        "type" : [
            {"id": "0","value": "临分"},
            {"id": "1","value": "合约"},
            {"id": "2","value": "合约临分"}
        ],
        //纳税人身份
        "taxpayerstatus" : [
            {"id": "Y","value": "一般纳税人"},
            {"id": "X","value": "小规模纳税人"},
            {"id": "Q","value": "其他"}
        ],
        //境内境外
        "locationFlag" :[
            {"id": "D","value": "境内"},
            {"id": "F","value": "境外"}
        ],
        //所在城市/地区
        "regionCode" :[
            {"id": "1北京","value": "北京"},
            {"id": "2上海","value": "上海"},
            {"id": "3深圳","value": "深圳"},
            {"id": "4广州","value": "广州"},
            {"id": "5成都","value": "成都"},
            {"id": "6重庆","value": "重庆"},
            {"id": "1英国","value": "英国"},
            {"id": "2德国","value": "德国"},
            {"id": "3法国","value": "法国"},
            {"id": "4美国","value": "美国"},
            {"id": "5日本","value": "日本"},
            {"id": "6马来西亚","value": "马来西亚"},
            {"id": "7韩国","value": "韩国"},
            {"id": "8香港","value": "香港"},
            {"id": "9澳门","value": "澳门"},
            {"id": "10台湾","value": "台湾"},
            {"id": "11其他","value": "其他"}
        ],   
        //再保人增加字段
        /*//证件类型
        "" :[
            {"id": "01","value": "居民身份证"},
            {"id": "02","value": "居民户口薄"},
            {"id": "03","value": "护照"},
            {"id": "04","value": "军官证"},
            {"id": "05","value": "驾驶执照"},
            {"id": "06","value": "返乡证"},
            {"id": "07","value": "组织机构代码证"},
            {"id": "08","value": "士兵证"},
            {"id": "09","value": "临时身份证"},
            {"id": "10","value": "警官证"},
            {"id": "11","value": "学生证"},
            {"id": "12","value": "军官离退休证"},
            {"id": "13","value": "港澳通行证"},
            {"id": "14","value": "台湾通行证"},
            {"id": "15","value": "旅行证"},
            {"id": "16","value": "居留证件"},
            {"id": "17","value": "中国护照"},
            {"id": "18","value": "台胞证"},
            {"id": "19","value": "无法收集证件资料"},
            {"id": "20","value": "回乡证"},
            {"id": "21","value": "外籍在华驾驶证"},
            {"id": "22","value": "军队驾驶证"},
            {"id": "99","value": "其他"}
        ],
        //对公对私状态
        "accountProp":[
            {"id": "0","value": "公对私"},
            {"id": "1","value": "公对公"}
        ],
        //加急标志
        "":[
            {"id": "0","value": "普通"},
            {"id": "1","value": "加急"}
        ],
        //短信通知标识
        "":[
            {"id": "0","value": "否"},
            {"id": "1","value": "是"}
        ],
        //卡折标志
        "":[
            {"id": "1","value": "存着"},
            {"id": "2","value": "借记卡"},
            {"id": "3","value": "贷记卡"},
            {"id": "4","value": "准贷记卡"}
        ],*/

        //其他评级
        "assessType":[
            {"id": "03","value": "其他评级"}
        ],
        //获得应税免税标识
    	"vatFlag" : [
    		{'id': "0", "value": "0-免税"},
    		{"id": "1", "value": "1-应税"}
    	],
    	"cashLossFlag":[
        {"id":"0","value":"0-整个危险单位的估损"},
        {"id":"1","value":"1-进入合约的部分估损"}
    ],
       "cleanMode":[
        {"id":"0","value":"0-Run Off"},
        {"id":"1","value":"1-Clean Cut"}
    ]
    }
);